[
    {
        "name": "Neujahrstag",
        "name2": "New Year's Day",
        "summary": "Neujahrstag, or New Year's Day, is celebrated on January 1st as the start of the calendar year. In German-speaking regions like Switzerland, Austria, and Germany, it is both a time for rest and renewal. Many people reflect on the past year, make resolutions, and spend the day with family or friends. Religious services in Christian traditions, such as the Solemnity of Mary, Mother of God, often mark the day. Fireworks and celebrations from New Year's Eve usually extend into the early hours of Neujahrstag, making it a joyful yet introspective holiday.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Mexico_City_New_Years_2013%21_%288333128248%29.jpg/1200px-Mexico_City_New_Years_2013%21_%288333128248%29.jpg"
    },
    {
        "name": "Berchtoldstag",
        "name2": "Berchtold's Day",
        "summary": "Berchtoldstag, or Berchtold's Day, is observed on January 2nd, primarily in Switzerland. It is thought to have its origins in ancient Alemannic midwinter customs or possibly a connection to Duke Berchtold V of Zähringen. Today, the holiday is less about historical significance and more about fostering community spirit. Families and friends gather to share meals, participate in games, and enjoy relaxed social gatherings. Traditional foods, such as nuts and dried fruits, often accompany the festivities, symbolizing abundance and good fortune.",
        "image": "https://storage.googleapis.com/rro-app-2020.appspot.com/stories%2F350517%2F17838786.jpg?alt=media&cacheBuster=1704206483746"
    },
    {
        "name": "Dreikönigstag",
        "name2": "Epiphany",
        "summary": "Dreikönigstag, or Epiphany, takes place on January 6th and celebrates the visit of the Three Wise Men to the infant Jesus. The holiday, also known as Three Kings' Day, symbolizes the revelation of Christ to the world. In German-speaking regions, traditions include the Sternsinger (Star Singers), where children dressed as the Magi sing carols and collect donations for charity. Families often enjoy a special 'King Cake,' with a hidden token that crowns one person as 'king' for the day. Religious ceremonies, chalk blessings of homes, and community gatherings make this a cherished event.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Giotto_-_Scrovegni_-_-18-_-_Adoration_of_the_Magi.jpg"
    },
    {
        "name": "Antoniustag",
        "name2": "Saint Anthony's Day",
        "summary": "Antoniustag, or Saint Anthony's Day, honors Saint Anthony the Abbot, one of the founders of monasticism. Celebrated on January 17th, it is especially meaningful for farmers and rural communities. As the patron saint of animals and farmers, Saint Anthony is invoked for the protection and health of livestock. The day often includes the blessing of animals and processions through local villages. Bonfires, symbolizing purification, are lit in some areas, and the day serves as a moment to reflect on the values of humility and faith in daily life.",
        "image": "https://www.catholictradition.org/Eucharist/charbel-anthony.jpg"
    },
    {
        "name": "Meinradstag",
        "name2": "Saint Meinrad's Day",
        "summary": "Meinradstag, or Saint Meinrad's Day, is celebrated on January 21st in honor of Saint Meinrad of Einsiedeln, a monk and martyr. Known for his life of solitude and prayer, Meinrad is also remembered as the 'Martyr of Hospitality' for his willingness to welcome pilgrims. He was killed by robbers at his hermitage, which later became the site of Einsiedeln Abbey in Switzerland. On this day, religious services and pilgrimages to Einsiedeln commemorate his life, highlighting themes of generosity, devotion, and faith.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQX0H5EThdo3EMT_EFQBIYEP8eGiKQEs9L75LjLyCTy7eiPkK8nK4mz3vpQxeI94g-fkWA&usqp=CAU"
    },
    {
        "name": "Mariä Lichtmess",
        "name2": "Feast of the Presentation of Mary",
        "summary": "Mariä Lichtmess, or Candlemas, observed on February 2nd, commemorates the presentation of Jesus at the Temple and the purification of Mary. The holiday is rooted in Christian tradition and symbolizes light and hope, with candles blessed during church services to represent Jesus as the light of the world. It traditionally marks the end of the Christmas season in German-speaking regions. In rural areas, Candlemas was historically seen as the time to prepare for spring and renew spiritual commitments.",
        "image": "https://www.marypages.com/assets/images/ori/PresentationoftheLord.jpg"
    },
    {
        "name": "Agathatag",
        "name2": "Saint Agatha's Day",
        "summary": "Agathatag, or Saint Agatha's Day, is celebrated on February 5th in honor of Saint Agatha, a 3rd-century Christian martyr. Known as the patroness of protection against fire, earthquakes, and volcanic eruptions, Saint Agatha is deeply venerated in Italy and other parts of Europe. On this day, bread is often blessed as a symbol of sustenance and protection. Her unwavering faith and sacrifice continue to inspire devotion and prayer, making this a significant day for the faithful.",
        "image": "https://www.marypages.com/assets/images/AgathavanSicilie.jpg"
    },
    {
        "name": "Jahrestag der Ausrufung der Republik",
        "name2": "Anniversary of the Proclamation of the Republic",
        "summary": "Jahrestag der Ausrufung der Republik, or Anniversary of the Proclamation of the Republic, marks a pivotal day in Austrian history when the nation declared itself a republic. This event, observed annually, commemorates Austria's transition from a monarchy to a republic following the end of World War I in 1918. The day is a time for reflection on the country's democratic values and national identity. Events often include public speeches, historical exhibits, and educational programs to honor the significance of this transformation.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Ausrufung_der_Republik_Deutsch%C3%B6sterreich_1918_Parlamentsrampe.jpg"
    },
    {
        "name": "Josephstag",
        "name2": "Saint Joseph's Day",
        "summary": "Josephstag, or Saint Joseph's Day, is celebrated on March 19th in honor of Saint Joseph, the spouse of the Virgin Mary and the earthly father of Jesus. As the patron saint of workers, families, and fathers, Saint Joseph is widely venerated. The day is marked by church services and special prayers, particularly in Catholic communities. In some regions, people prepare traditional dishes and hold celebrations to emphasize the importance of Saint Joseph's humility and dedication to his family.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Saint-Joseph-Atzwang-detail.jpg/1200px-Saint-Joseph-Atzwang-detail.jpg"
    },
    {
        "name": "Heiliger Benedikt",
        "name2": "Saint Benedict",
        "summary": "Observed on March 21st, Heiliger Benedikt, or Saint Benedict's Day, honors the founder of Western monasticism. Saint Benedict is credited with establishing the Benedictine order and composing the Rule of Saint Benedict, a guide for monastic living. This holiday is especially significant in monasteries and religious communities where his teachings continue to inspire faith, discipline, and humility. It is a time for reflection on spiritual growth and the enduring influence of his work on Western Christianity.",
        "image": "https://www.erzdioezese-wien.at/img/59/29/3d66b3477b8873ab25a8/heiliger_Benedikt-Schottenstift_Benedikt_Schottenstift_fjr.jpg"
    },
    {
        "name": "Näfelser Fahrt",
        "name2": "Journey of Näfels",
        "summary": "Näfelser Fahrt, or the Journey of Näfels, commemorates the Battle of Näfels in 1388. Observed in Switzerland, this regional holiday is steeped in history, celebrating the Swiss Confederation's victory over the Habsburgs. The day includes a solemn pilgrimage to the battlefield, speeches, and a church service. It serves as a reminder of Swiss independence and resilience, bringing together communities to honor their shared history and cultural identity.",
        "image": "https://www.holidayscalendar.com/wp-content/uploads/2022/09/Nafelser-Fahrt.jpg"
    },
    {
        "name": "Karfreitag",
        "name2": "Good Friday",
        "summary": "Karfreitag, or Good Friday, is a deeply significant day in Christianity, observed two days before Easter Sunday. It commemorates the crucifixion and death of Jesus Christ at Calvary. In German-speaking regions, this solemn holiday is marked by church services, processions, and fasting. The quiet and reflective atmosphere encourages individuals to meditate on themes of sacrifice, redemption, and hope, making it one of the most profound observances in the Christian calendar.",
        "image": "https://www.erzbistum-paderborn.de/wp-content/uploads/sites/6/2023/03/shutterstock_2041365788_skaliert-scaled.jpg"
    },
    {
        "name": "Ostermontag",
        "name2": "Easter Monday",
        "summary": "Ostermontag, or Easter Monday, is celebrated as a continuation of Easter festivities. Falling on the day after Easter Sunday, it is a public holiday in many Christian countries. Families often gather for meals, egg hunts, and outdoor activities. The day also marks the appearance of Jesus to his disciples after his resurrection, symbolizing new beginnings and the triumph of life over death. The festive and family-oriented nature of Ostermontag contrasts with the solemnity of Good Friday.",
        "image": "https://c.tadst.com/gfx/750w/easter-monday.jpg"
    },
    {
        "name": "Sechseläuten",
        "name2": "The Six O'Clock Ringing",
        "summary": "Sechseläuten, or The Six O'Clock Ringing, is a traditional spring festival in Zurich, Switzerland. The centerpiece of the event is the burning of the Böögg, a snowman effigy whose destruction symbolizes the end of winter. The faster the Böögg burns, the better the summer weather is expected to be. The festival also includes colorful parades, costumes, and community celebrations, reflecting Zurich's rich cultural heritage and the joy of the changing seasons.",
        "image": "https://pbs.twimg.com/media/D3piP5rWsAAoIgp.jpg:large"
    },
    {
        "name": "Heiliger Sigismund",
        "name2": "Saint Sigismund",
        "summary": "Heiliger Sigismund, or Saint Sigismund's Day, is observed on May 1st in honor of the Christian martyr and former king of Burgundy. Known for his faith and acts of penance, Saint Sigismund's legacy is celebrated with religious services and historical reenactments. The holiday emphasizes themes of redemption, spiritual courage, and the enduring power of faith. In some regions, it is also an opportunity to learn about the rich history surrounding his reign and conversion to Christianity.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/1512_D%C3%BCrer_Kaiser_Sigismund_anagoria.JPG/1200px-1512_D%C3%BCrer_Kaiser_Sigismund_anagoria.JPG"
    },
    {
        "name": "Tag der Arbeit",
        "name2": "Labor Day",
        "summary": "Tag der Arbeit, or Labor Day, is celebrated on May 1st to honor workers and their contributions to society. The day often includes parades, rallies, and speeches advocating for workers' rights and social justice. In many countries, it is a public holiday dedicated to promoting solidarity and reflecting on the achievements of the labor movement. For communities, it represents a time to acknowledge the dignity of work and the importance of equitable labor practices.",
        "image": "https://www.bpb.de/cache/images/8/761608_teaser_3x2_800.png?CC12D"
    },
    {
        "name": "Auffahrt",
        "name2": "Ascension Day",
        "summary": "Auffahrt, or Ascension Day, is observed 40 days after Easter Sunday to commemorate Jesus Christ's ascension into heaven. It is a significant holiday in the Christian liturgical calendar, celebrated with church services, processions, and hymns. The day is a reminder of Christ's promise to return and offers a moment of spiritual reflection and hope for believers. In some communities, it also serves as an opportunity for family picnics and outdoor gatherings.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/8/85/Jesus_ascending_to_heaven.jpg"
    },
    {
        "name": "Pfingstmontag",
        "name2": "Pentecost Monday",
        "summary": "Pfingstmontag, or Pentecost Monday, is celebrated on the day after Pentecost Sunday, marking the descent of the Holy Spirit upon the apostles. It is a public holiday in many countries, featuring church services, community gatherings, and family events. The day symbolizes unity, renewal, and the growth of the Christian church. For many, it is also a time to connect with loved ones and reflect on the spiritual significance of the Pentecost season.",
        "image": "https://cruxnow.com/cdn-cgi/image/width=1920,quality=75/https://wp.cruxnow.com/wp-content/uploads/2021/06/Pentecost3.jpg"
    },
    {
        "name": "Fronleichnam",
        "name2": "Corpus Christi",
        "summary": "Fronleichnam, known in English as Corpus Christi, is a major feast in the Catholic Church celebrating the real presence of Christ in the Eucharist. Observed on the Thursday after Trinity Sunday, the day is marked by colorful processions, during which the Eucharist is carried through the streets under a canopy. This tradition symbolizes bringing the blessings of the Eucharist to the wider world, making it a deeply spiritual and community-focused celebration.",
        "image": "https://images.bild.de/5d0757a559ca420001fae6d0/bab4aed344c8fb5973488d3357f07d33,85f9dd66?w=992"
    },
    {
        "name": "Fest der Unabhängigkeit",
        "name2": "Festival of Independence",
        "summary": "Fest der Unabhängigkeit, or Festival of Independence, celebrates a nation's freedom and sovereignty. It is a day of patriotic pride filled with parades, fireworks, and communal gatherings. Often accompanied by speeches and historical reenactments, this holiday serves as a reminder of the struggles and sacrifices made to achieve independence, as well as an opportunity to reflect on the values of unity and self-determination.",
        "image": "https://cdn.swp.de/2024/04/01/cc5e06c7-5be8-42d2-8563-9b0a2e9774ef.jpeg?crop=1500%2C844%2C0%2C78&width=1500&format=webp&token=e32565cb6bc90cdb3cb526eacd0ca9755757ad372becc828725f8096e12f29bd"
    },
    {
        "name": "Peter und Paul",
        "name2": "Peter and Paul",
        "summary": "Peter und Paul, or the Feast of Saints Peter and Paul, is observed on June 29th and honors two of the most prominent apostles in Christianity. Saint Peter, the first Pope, is remembered for his leadership of the early Church, while Saint Paul is celebrated for his missionary work and epistles. This day is marked with church services, special prayers, and reflections on their contributions to spreading Christianity across the ancient world.",
        "image": "https://nationaltoday.com/wp-content/uploads/2022/08/4567918-min.jpg"
    },
    {
        "name": "Christmas Holidays",
        "summary": "The Christmas Holidays are a festive period celebrated from late December into early January, encompassing Christmas Day, New Year's Day, and often Epiphany. Families gather to exchange gifts, enjoy meals, and partake in religious services. The season is filled with lights, caroling, and decorations, reflecting themes of generosity, love, and joy, making it a magical time of year for people around the world.",
        "image": "https://i.natgeofe.com/k/dfc7bec2-0657-4887-81a7-6d024a8c3f70/WH-XmasTree_3x2.jpg"
    },
    {
        "name": "Semester Holidays",
        "summary": "Semester Holidays are a mid-term break for students, offering a chance to recharge before the next academic term. Popular in Austria, these holidays are often spent enjoying winter activities like skiing, relaxing with family, or engaging in short trips. This brief respite plays an essential role in maintaining balance and fostering productivity for both students and teachers.",
        "image": "https://admin.expatica.com/at/wp-content/uploads/sites/16/2023/11/children-skiing-holiday-austria.jpg"
    },
    {
        "name": "Saint Joseph's Day",
        "summary": "Saint Joseph's Day is celebrated on March 19th to honor Saint Joseph, the husband of the Virgin Mary and the patron saint of workers and families. This day is observed with church services, feasts, and community activities. In many cultures, Saint Joseph symbolizes hard work, humility, and devotion, making this day a time for families to come together and celebrate these enduring values.",
        "image": "https://catholicsaintmedals.com/wp-content/uploads/joseph-and-jesus.jpg"
    },
    {
        "name": "Easter Holidays",
        "summary": "The Easter Holidays celebrate the resurrection of Jesus Christ, a cornerstone of Christian faith. These holidays, spanning from Good Friday to Easter Monday, are marked by church services, family meals, and customs like egg painting and hunts. The season symbolizes renewal, hope, and the victory of life over death, making it a joyous time for reflection and togetherness.",
        "image": "https://i0.wp.com/www.traveltyrol.com/wp-content/uploads/2023/03/Easter-in-Austria.jpg?resize=1024%2C576&ssl=1"
    },
    {
        "name": "Pentecost Holidays",
        "summary": "The Pentecost Holidays commemorate the descent of the Holy Spirit upon the apostles, marking the birth of the Christian Church. Celebrated 50 days after Easter, this period is a time for religious observances and community gatherings. Families often take the opportunity to relax and reflect on themes of unity, spiritual renewal, and divine guidance.",
        "image": "https://i0.wp.com/thesacredpage.com/wp-content/uploads/2020/05/Pentecost-Painting.jpg?fit=780%2C593&ssl=1"
    },
    {
        "name": "Summer Holidays",
        "summary": "Summer Holidays are the longest school break in Austria, spanning from July to September. Families use this time for vacations, outdoor adventures, and cultural activities. From exploring Austria's scenic landscapes to participating in summer camps, these holidays are cherished for relaxation and quality time, embodying the carefree spirit of summer.",
        "image": "https://weather2travel.com/images_blog/best-ways-to-experience-austria-in-summer.jpg"
    },
    {
        "name": "Autumn Holidays",
        "summary": "The Autumn Holidays provide a short break for students, coinciding with All Saints' Day on November 1st. This time is often used to enjoy the vibrant fall foliage, attend local festivals, and participate in cultural traditions. It also serves as a moment for rest and preparation before the busy winter season.",
        "image": "https://www.hallstatt.net/assets/image-gallery/neue-contentpage/herbsturlaub/_resampled/CroppedFocusedImageWzgwMCw0NTAsInkiLDQyXQ/hallstatt-hauptansicht-herbst-09.jpg"
    },
    {
        "name": "All Souls' Day",
        "summary": "All Souls' Day, observed on November 2nd, is a Christian tradition to honor and pray for the deceased. Families visit cemeteries, light candles, and offer prayers in memory of loved ones. This solemn yet comforting holiday reflects themes of remembrance, love, and the enduring connection between the living and the departed.",
        "image": "https://lifeinitaly.com/wp-content/uploads/2018/08/skogskyrkogc3a5rden_at_all_saints_day_2010-4.jpg"
    },
    {
        "name": "Christmas Holidays (School)",
        "summary": "The school-specific Christmas Holidays align with the broader festive season, giving students time off to celebrate with family. Activities often include decorating Christmas trees, attending religious services, and enjoying traditional meals. These holidays are filled with joy, warmth, and the magic of the Christmas season.",
        "image": "https://thesnowmag.com/wp-content/uploads/2019/11/Day-1-Innsbruck-Christkindlmarkt.jpg"
    }
]
